import styles from './style/footer.module.scss'
import Link from 'next/link';


export default function Footer(props) {

    return (
        <footer className={styles.footer_section}>
            <div className={[styles.container , styles.first_footer].join(' ') }>
                <div className={[styles.footer_col_right , styles.about_col].join(' ') }>
                    <h6 className={styles.col_title}>گروه دوچرخه‌سواری دامون</h6>
                    <p className={styles.footer_desc}>
                    گروه دوچرخه‌سواری دامون در ابتدای سال ۱۳۹۸ با هدف ترویج دوچرخه‌سواری شهری، تشویق مردم به استفاده از دوچرخه بعنوان وسیله نقلیه و کمک در کم شدن ترافیک و آلودگی هوا تاسیس شد.
در طول این چهار سال فعالیت، دامون موفق به تحویل حداقل ۵۰۰ رکابزن به جامعه دوچرخه‌سواری شده است.
و در هر برنامه‌ی هفتگی شهری بصورت میانگین ۵۰ دوچرخه‌سوار را با حفظ امنیت و سلامت، از مبدا به مقاصد مختلف می‌برد.
تنوع افراد یکی از ویژگی‌های اصلی گروه دامون می‌باشد، در این گروه افراد در تمامی رده‌های سنی، اجتماعی، شغلی و تحصیلی مانند یک خانواده متحد، در کنار یک‌دیگر قرار دارند.
دامون در دوران سخت همه‌گیری کرونا توانست افراد بسیاری را به سمت دوچرخه تشویق کرده و گامی مهم در مقابله با فضای یاس جامعه بردارد.
این گروه پس از دو سال فعالیت با استقبال بالای افراد، اقدام به برگزاری تورهای خارج از شهر تهران و طبیعت زیبای ایران نمود و تجربه‌های تکرارنشدنی را برای عموم افراد با هر توان دوچرخه‌سواری رقم زد.
رسالت دامون همیشه تاثیرگذاری در جامعه، تمرین جامعه مدنی، احترام به قانون و تربیت افرادی مطالبه‌گر و قانون‌مدار بوده و خواهد بود
                    </p>
                </div>
                <div className={styles.footer_col}>
                    <a target="_blank" href="https://trustseal.enamad.ir/?id=234513&amp;Code=EgjzOzgQPL0GfcMihusD">
                        <img  src="https://Trustseal.eNamad.ir/logo.aspx?id=234513&amp;Code=EgjzOzgQPL0GfcMihusD" alt="" style={{cursorPointer: 'cursor'}} id="EgjzOzgQPL0GfcMihusD" />
                    </a>
                </div>
         

                <div className={[styles.footer_col , styles.quick_links_col].join(' ') }>
                    <h6 className={styles.col_title}>دسترسی سریع</h6>
                    <ul className={styles.footer_links}>
                        <li>
                            <Link href="/about-us">درباره ما</Link>
                        </li>
                        <li>
                            <Link href="/about-us">تماس با ما</Link>
                        </li>
                        <li>
                            <Link href="#">اخبار</Link>
                        </li>
                        <li>
                            <Link href="#">قوانین</Link>
                        </li>
                        <li>
                            <Link href="#">نقشه سایت</Link>
                        </li>
                    </ul>
                </div>

               
                <hr />
            </div>
            <div className={[styles.container , styles.secound_footer].join(' ') }>
                <div className={styles.copy_right_col}>
                    <p className={styles.copyright_text}>
                        &copy;
                        تمامی حقوق متعلق به گروه دوچرخه‌سواری دامون است.
                    </p>
                </div>
                <div className={styles.social_col}>
                    <ul className={styles.social_icons}>
                        <li>
                            <a className={[styles.social_link , styles.facebook].join(' ') } href="https://www.instagram.com/damoonbikers/">
                            <span id="boot-icon" className="bi bi-instagram" style={{fontSize:'10rem'}}></span>
                            </a>
                        </li>
                        <li>
                            <a className={[styles.social_link , styles.twitter].join(' ') } href="https://t.me/s/damoonbiker">
                            <span className="bi bi-telegram"></span>
                            </a>
                        </li>
                        <li>
                            <a className={[styles.social_link , styles.dribbble].join(' ') } href="https://www.aparat.com/damoonbiker">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" className={styles.icon_3q_Xb}>
                                    <path d="M4.00079 6.86359C4.18594 6.05798 4.33899 5.24347 4.56313 4.44874C5.04598 2.74158 6.81396 1.70305 8.56614 2.07494C9.26376 2.22331 9.95841 2.38205 10.654 2.53734C10.713 2.55477 10.771 2.57524 10.8278 2.59866C7.90309 3.03831 5.65966 4.47742 4.00079 6.86359Z" fill="currentColor"></path>
                                    <path d="M21.4027 10.8242C20.9638 7.90642 19.5266 5.66367 17.1291 4.00449C17.3444 4.05361 17.5595 4.10306 17.7744 4.15285C18.3017 4.27104 18.8309 4.38281 19.3567 4.50793C20.2285 4.71282 20.9855 5.2514 21.4658 6.0084C21.9461 6.76539 22.1115 7.68063 21.9265 8.55822C21.7809 9.25553 21.6199 9.94986 21.4649 10.6452C21.4545 10.6892 21.4338 10.7342 21.4027 10.8242Z" fill="currentColor"></path>
                                    <path d="M13.1707 21.3981C16.1053 20.9564 18.3438 19.5148 19.9883 17.1153C19.7503 18.0584 19.6496 19.0332 19.2932 19.9416C19.0857 20.4553 18.7431 20.9031 18.3018 21.2373C17.4037 21.9391 16.3966 22.1507 15.2902 21.8961C14.6592 21.7512 14.0277 21.6102 13.3968 21.4663C13.3331 21.4529 13.2733 21.4297 13.1707 21.3981Z" fill="currentColor"></path>
                                    <path d="M2.59812 13.1723C3.03654 16.0941 4.47669 18.3353 6.87416 19.991C6.33107 19.8699 5.78454 19.7522 5.24096 19.6271C4.92202 19.5534 4.59913 19.4911 4.28958 19.3832C3.50416 19.1084 2.84581 18.556 2.43797 17.8296C2.03013 17.1033 1.90083 16.2528 2.0743 15.4378C2.22241 14.7405 2.38089 14.0462 2.53592 13.3503C2.54628 13.3039 2.56702 13.2598 2.59812 13.1723Z" fill="currentColor"></path>
                                    <path d="M12.0082 3.57355C7.36681 3.56811 3.57955 7.34938 3.57313 11.9897C3.56671 16.6299 7.35002 20.4176 11.9929 20.4226C16.6357 20.4275 20.422 16.6463 20.427 12.005C20.4319 7.36372 16.651 3.57899 12.0082 3.57355ZM9.89214 6.21539C10.3076 6.2151 10.7137 6.3383 11.0592 6.56939C11.4046 6.80048 11.6739 7.12906 11.8328 7.51352C11.9917 7.89799 12.0331 8.32104 11.9518 8.7291C11.8705 9.13717 11.6701 9.51189 11.3761 9.80581C11.082 10.0997 10.7075 10.2996 10.3 10.3802C9.89242 10.4608 9.47017 10.4184 9.08669 10.2584C8.7032 10.0984 8.37575 9.82803 8.14578 9.48149C7.91581 9.13496 7.79368 8.72786 7.79485 8.31175C7.79485 8.03608 7.84913 7.76312 7.95459 7.50848C8.06004 7.25385 8.21459 7.02255 8.4094 6.82783C8.60421 6.6331 8.83545 6.47878 9.08988 6.37369C9.34431 6.2686 9.61693 6.21481 9.89214 6.21539ZM8.3251 16.2051C7.90992 16.2057 7.50389 16.0829 7.15838 15.8523C6.81288 15.6217 6.54341 15.2937 6.38408 14.9096C6.22474 14.5256 6.1827 14.1029 6.26327 13.6949C6.34383 13.2869 6.54339 12.912 6.83669 12.6177C7.12999 12.3233 7.50386 12.1227 7.91099 12.0413C8.31813 11.9598 8.74024 12.0011 9.12393 12.16C9.50762 12.3189 9.83565 12.5882 10.0665 12.9338C10.2974 13.2795 10.4207 13.686 10.4209 14.1018C10.4227 14.3781 10.3697 14.652 10.265 14.9076C10.1603 15.1632 10.0061 15.3955 9.81112 15.5909C9.61618 15.7864 9.38445 15.9411 9.12937 16.0462C8.87428 16.1513 8.60091 16.2047 8.3251 16.2032V16.2051ZM10.9536 11.9555C10.9584 11.7491 11.0239 11.5488 11.1419 11.3795C11.2599 11.2103 11.4251 11.0797 11.6169 11.0041C11.8087 10.9285 12.0185 10.9114 12.22 10.9548C12.4215 10.9982 12.6057 11.1002 12.7496 11.248C12.8934 11.3958 12.9905 11.5829 13.0286 11.7858C13.0667 11.9887 13.0442 12.1983 12.9639 12.3884C12.8836 12.5785 12.749 12.7407 12.577 12.8545C12.4051 12.9683 12.2034 13.0287 11.9973 13.0282C11.858 13.0274 11.7202 12.9989 11.592 12.9443C11.4638 12.8896 11.3478 12.81 11.2506 12.71C11.1535 12.6099 11.0772 12.4915 11.0262 12.3617C10.9752 12.2318 10.9505 12.0931 10.9536 11.9536V11.9555ZM14.1134 17.7837C13.698 17.7849 13.2915 17.6625 12.9456 17.4322C12.5996 17.2018 12.3297 16.8738 12.17 16.4897C12.0103 16.1056 11.968 15.6826 12.0484 15.2744C12.1288 14.8661 12.3284 14.491 12.6218 14.1964C12.9153 13.9019 13.2893 13.7012 13.6967 13.6198C14.1041 13.5383 14.5264 13.5798 14.9103 13.739C15.2941 13.8982 15.6221 14.1679 15.8528 14.5139C16.0835 14.8599 16.2065 15.2668 16.2062 15.6829C16.2065 15.9585 16.1525 16.2314 16.0474 16.486C15.9423 16.7407 15.7881 16.9721 15.5936 17.1671C15.3992 17.362 15.1682 17.5166 14.9141 17.6221C14.6599 17.7275 14.3875 17.7818 14.1124 17.7817L14.1134 17.7837ZM15.7051 11.9976C15.4259 12.0052 15.148 11.9568 14.8877 11.8555C14.6274 11.7541 14.39 11.6017 14.1892 11.4072C13.9885 11.2128 13.8285 10.9801 13.7186 10.7229C13.6088 10.4657 13.5513 10.1891 13.5495 9.9094C13.5477 9.62966 13.6017 9.35238 13.7083 9.0938C13.8149 8.83523 13.9719 8.60056 14.1702 8.40354C14.3684 8.20653 14.604 8.05113 14.863 7.94646C15.1219 7.84179 15.3992 7.78995 15.6784 7.79397C16.2275 7.80188 16.7515 8.02501 17.1382 8.41548C17.5249 8.80596 17.7435 9.33269 17.747 9.88269C17.7505 10.4327 17.5386 10.9622 17.1569 11.3575C16.7752 11.7529 16.254 11.9827 15.7051 11.9976Z" fill="currentColor"></path>
                                </svg>
                            </a>
                        </li>
                      
                    </ul>
                </div>
            </div>
        </footer>
    );
}
